Autodesk.Revit.DB.IFCParameterTemplate.AddPropertyMappingInfo(Autodesk.Revit.DB.PropertySetupType,System.String,Autodesk.Revit.DB.IFCPropertyMappingInfo)
Adds a property mapping info to the property set.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
propertyMappingInfo:
The property mapping info.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The mapping info is invalid.
-or-
A property set with the given name is not present in the template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.IsPropertySetAMemberOfTemplate(Autodesk.Revit.DB.PropertySetupType,System.String)
Checks whether a property set exists in the template.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
Returns:
True if the property set exists in the template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.RemovePropertyMappingInfo(Autodesk.Revit.DB.PropertySetupType,System.String,Autodesk.Revit.DB.ElementId)
Removes the property mapping from the property set by id.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
revitPropertyId:
The Revit property id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.RemovePropertyMappingInfo(Autodesk.Revit.DB.PropertySetupType,System.String,System.String)
Removes the property mapping from the property set by name.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
propertyName:
The property name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.FindPropertyMappingInfo(Autodesk.Revit.DB.PropertySetupType,System.String,Autodesk.Revit.DB.ElementId)
Finds the property mapping info in the property set by id.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
revitPropertyId:
The Revit property id.
Returns:
The property mapping info or nullptr if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.FindPropertyMappingInfo(Autodesk.Revit.DB.PropertySetupType,System.String,System.String)
Finds the property mapping info in the property set by name.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
propertyName:
The property name.
Returns:
The property mapping info or nullptr if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.GetPropertyMappingInfos(Autodesk.Revit.DB.PropertySetupType,System.String,Autodesk.Revit.DB.PropertySelectionType)
Creates an array of property mappings contained in the property set according to provided selection type.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
propertySelectionType:
The property selection type.
Returns:
The array of the property mappings in the property set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ClearPropertySets(Autodesk.Revit.DB.PropertySetupType)
Removes all property sets from the template.
propertySetupType:
The property setup type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.RemovePropertySet(Autodesk.Revit.DB.PropertySetupType,System.String)
Removes provided property set from the template.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A property set with the given name is not present in the template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.CopyPropertySet(Autodesk.Revit.DB.PropertySetupType,System.String,System.String)
Creates a copy of the property set and adds it to the template.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
propertySetCopyName:
The name of the copied property set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A property set with the given name is not present in the template.
-or-
A property set with the given name already exists in the template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.AddPropertySet(Autodesk.Revit.DB.PropertySetupType,System.Boolean,System.String)
Adds a property set to the template.
propertySetupType:
The property setup type.
exportFlag:
The flag that indicates whether the property set is included in export.
propertySetName:
The property set name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A property set with the given name already exists in the template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.GetPropertySetNames(Autodesk.Revit.DB.PropertySetupType,Autodesk.Revit.DB.PropertySelectionType)
Creates an array of property set names contained in the template according to provided selection type.
propertySetupType:
The property setup type.
propertySelectionType:
The property selection type.
Returns:
The array of the property set names in the template.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.SetPropertySetApplicableEntities(Autodesk.Revit.DB.PropertySetupType,System.String,System.Collections.Generic.IList{System.String})
Sets the list of IFC entities to which the property set is applicable.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
applicableEntities:
The list of IFC entities to which the property set is applicable.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A property set with the given name is not present in the template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.GetPropertySetApplicableEntities(Autodesk.Revit.DB.PropertySetupType,System.String)
Gets the list of IFC entities to which the property set is applicable.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
Returns:
The list of IFC entities to which the property set is applicable.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A property set with the given name is not present in the template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.SetPropertySetExportingFlag(Autodesk.Revit.DB.PropertySetupType,System.String,System.Boolean)
Define whether the provided property set must be included in export.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
exportFlag:
The export flag.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A property set with the given name is not present in the template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.IsExportingPropertySet(Autodesk.Revit.DB.PropertySetupType,System.String)
Determines whether the provided property set is included in export.
propertySetupType:
The property setup type.
propertySetName:
The property set name.
Returns:
Whether or not the property set is included in export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A property set with the given name is not present in the template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ImportPropertySetupFromFile(System.String)
Imports mapping information from a text file.
fileName:
The full text file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Failed to access the text file.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ExportPropertySetupToFile(Autodesk.Revit.DB.PropertySetupType,System.String)
Exports mapping information of the provided property setup to a text file.
propertySetupType:
The property setup type.
fileName:
The full text file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.FileAccessException:
Failed to access the text file.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.IsInSessionTemplate
Returns true if this is an in-session template.
Returns:
Whether or not the template is in-session.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.IsValidName(Autodesk.Revit.DB.Document,System.String)
Returns result that the proposed name is valid and not exist in the specified document.
Remarks:
Name can't contains following characters, such as { } [ ] | ; < > ? ` ~ \ : \r \n \f \t \v.
Name can't be blank.
If true, the name is valid and not exist in specified document.
If false, the name is not a valid name which means it does not exist in specified document.
document:
The document to check
name:
The name to check.
Returns:
Whether or not the name is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ListNames(Autodesk.Revit.DB.Document)
Returns a list of names of IFC export parameter mapping templates.
document:
The Revit document to retrieve names from.
Returns:
The array of strings representing names of predefined setups.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.SetInSessionTemplateDocument(Autodesk.Revit.DB.Document)
Set document for in-session template.
Remarks:
The document is used for non built-in parameters mapping.
document:
The Revit document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The template is not an is-session.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.CopyTemplate(Autodesk.Revit.DB.Document,System.String)
Create copy of mapping template with new name.
Remarks:
The copied template is saved in the document passed as parameter.
Passing the same document as the source template's document will create a new template in the same document.
The active template of the document remains unchanged.
document:
The Revit document to save the copied template.
copyTemplateName:
The name for copied template name.
Returns:
The copied mapping template element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create IFCParameterTemplate element.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ExportToFile(System.String)
Export mapping template to a text file.
fileName:
The full text file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Failed to access the text file.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ImportFromFile(Autodesk.Revit.DB.Document,System.String,System.String)
Import mapping template from a text file.
Remarks:
The imported template is saved in the document passed as parameter.
The active template of the document remains unchanged.
document:
The Revit document.
fileName:
The full text file name.
templateName:
The mapping template name.
Returns:
The mapping template element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Failed to access the text file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create IFCParameterTemplate.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ResetActiveTemplate(Autodesk.Revit.DB.Document)
Removes the information about active mapping temple of the document.
Remarks:
After calling this method, the active template of the document will be nullptr,
which means that in-session template should be used.
document:
The document to set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.GetActiveTemplate(Autodesk.Revit.DB.Document)
Gets the active mapping template element in the document.
Remarks:
New documents have no active mapping template and it implies in-session template usage.
document:
The document to find the active mapping template.
Returns:
The active mapping template, or nullptr if none.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.SetActiveTemplate
Sets the mapping template element to be the active mapping template for its document.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Invalid use of in-session template.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.GetOrCreateInSessionTemplate(Autodesk.Revit.DB.Document)
Gets the in-session non-serializable template or create new.
document:
The document where created mapping template is saved.
Returns:
The mapping template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.FindByName(Autodesk.Revit.DB.Document,System.String)
Returns mapping template element by name.
document:
The document to find the mapping template with the specified name.
name:
Name of the mapping template to find.
Returns:
The mapping template element, or nullptr if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.Create(Autodesk.Revit.DB.Document,System.String)
Create an IFC parameter mapping template with default values.
document:
The document where created mapping template is saved.
name:
The name specified to this mapping template.
Returns:
The new mapping template instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ExportUserDefinedPropertySets
The option to export user-defined property sets.
If true, then all user-defined property sets not excluded will be exported.
If false, then no user-defined property sets will be exported.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ExportRevitSchedules
The option to export Revit schedules to IFC.
If true, then all Revit schedules not excluded will be exported.
If false, then no Revit schedules will be exported.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ExportRevitMaterialParameters
The option to export Revit material parameters to IFC.
If true, then all Revit material parameters not excluded will be exported.
If false, then no Revit material parameters will be exported.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ExportRevitElementParameters
The option to export Revit element parameters to IFC.
If true, then all Revit element parameters not excluded will be exported.
If false, then no Revit element parameters will be exported.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ExportIFCBaseQuantities
The option to export IFC base quantities for exported Revit elements.
If true, then all IFC base quantities not excluded will be exported.
If false, then no IFC base quantities will be exported.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.ExportIFCCommonPropertySets
The option to export IFC common property sets for exported Revit elements.
If true, then all IFC Common Property Sets not excluded will be exported.
If false, then no IFC Common Property Sets will be exported.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.IsValidParameterMappingFile
Whether or not the parameter mapping file is valid.
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate.#ctor(Autodesk.Revit.DB.Document)
Custom constructor for this element.
document:
The document where created template is saved.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCParameterTemplate
Represents an element that contains an IFC parameter mapping template stored in a Revit document.
Since:
2026